In [1]:
# databse
# database vitra table hunxa vanesi one data base can have multiple tables

# Connect and Create a New Database

In [2]:
import sqlite3

In [3]:
con = sqlite3.connect('student.db') # create and connect to the databse

In [4]:
con

In [5]:
type(con)

sqlite3.Connection

After connection we need to execute sql query to read, write on database table.  Therefore, we need cursor to do so. cursor executes sql query

In [6]:
cur = con.cursor() # cursor executes SQL query

# Create table on databse

```sql
create table table_name (
roll_no int, 
name varchar(20),
```

In [7]:
create_table_query = """
create table student (roll_no int, name varchar(40))
"""

In [8]:
cur.execute(create_table_query)

OperationalError: table student already exists

# Insert operation on SQL

```sql
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...),
(value11, value12, value13, ...);
```

In [ ]:
insert_data_query = """
Insert into student 
(roll_no, name)
values 
(1, "Sandeep"),
(2, "Shaurya"),
(3, "Kshitiz")
"""

In [ ]:
cur.execute(insert_data_query)

# Read data from a table

```sql
select * from table_name
```

In [ ]:
read_query = """
select * from student
"""

In [ ]:
cur.execute(read_query)

In [ ]:
cur.execute(read_query).fetchall()

In [ ]:
cur.execute("select name from student").fetchall() # read name column only

In [ ]:
# find the roll no of student named Kshitiz
# use where statement for conditional operation
cur.execute("select roll_no from student where name = 'Kshitiz'").fetchall()

# update in sql

```sql
update table_name
set column1 = value1 
WHERE condition;
```

In [ ]:
# i want to update roll_no 3 name to Kshitiz Regmi

In [ ]:
updatename = """
update student 
set name = 'Kshitiz Regmi'
where 
roll_no = 3
"""

In [ ]:
cur.execute(updatename)

In [ ]:
cur.execute("Select * from student").fetchall()

# Delete operation in SQL

```sql
delete from table
where condition;
```

In [ ]:
cur.execute("delete from student where roll_no = 3")

In [ ]:
cur.execute("select * from student").fetchall()

In [ ]:
def create_insert_query(table_name, columns):
    
    insert = f"""
    Insert into {table_name} 
    {columns}
    values 
    (?, ?)
    """
    return insert

In [ ]:
query = create_insert_query(table_name = "student", 
                    columns = ('roll_no', 'name'),
                     )a

In [ ]:
print(query)

In [ ]:
datapoints = ((4, "shyam"), (5, 'ram'))
cur.executemany(query, datapoints)